#+TITLE: Tables
#+AUTHOR: Scimax VS Code Team
#+DATE: 2026-01-13
#+STARTUP: overview
#+OPTIONS: toc:2 num:t H:4
#+TODO: ⚠️ 👀 | ✅

** Formula Line

Formulas are defined in a #+TBLFM: line below the table:

| Item    | Qty | Price | Total |
|---------+-----+-------+-------|
| Apples  | 10  | 1.50  | 15    |
| Oranges | 5   | 2.00  | 10    |
|---------+-----+-------+-------|
| Sum     |     |       | 25    |
#+TBLFM: $4=$2*$3::@4$4=vsum(@2$4..@3$4)


*** Row Formula

Calculate total for each row:

| Item    | Q1 | Q2 | Q3 | Q4 | Total |
|---------+----+----+----+----+-------|
| Sales   | 10 | 20 | 30 | 40 |   100 |
| Costs   |  5 |  8 | 12 | 15 |    40 |
#+TBLFM: $6=$2+$3+$4+$5


*** Column Formula

Sum a column:

| Month | Revenue |
|-------+---------|
| Jan   | 10000   |
| Feb   | 12000   |
| Mar   | 15000   |
|-------+---------|
| Total | 37000   |
#+TBLFM: @>$2=vsum(@2$2..@-1$2)


*** ✅ Percentage Calculation
CLOSED: [2026-01-17 Sat 20:01]

| Category | Amount | Percent |
|----------+--------+---------|
| A        | 500    | 50%     |
| B        | 300    | 30%     |
| C        | 200    | 20%     |
|----------+--------+---------|
| Total    | 1000   | 100     |
|----------+--------+---------|
#+TBLFM: @>$2=vsum(@2$2..@-1$2)::@>$3=100::@2$3..@-1$3=100*$2/@>$2;%.0f%%

*** Table Parameters ($ rows)

Define parameters directly in the table using a row where cells contain
=$name=value= assignments:

| $tax=0.08 | $discount=0.10 |
|-----------+----------------|
| Price     | 0              |
|-----------+----------------|
| 100       | 108            |
| 200       | 216            |
#+TBLFM: $2=$1*(1+$tax)*(1-$discount)

The =$tax= and =$discount= values are extracted from the first row and can
be used as =$tax= and =$discount= in formulas.

*** Document Constants (#+CONSTANTS:)

Define constants at the document level using the =#+CONSTANTS:= keyword:

#+BEGIN_SRC org
,#+CONSTANTS: pi=3.14159 e=2.71828 tax_rate=0.075
#+END_SRC

Then use them in any table formula in the document:

| Radius | Area   |
|--------+--------|
| 5      | 78.54  |
| 10     | 314.16 |
#+TBLFM: $2=$pi*$1^2;%.2f

Multiple =#+CONSTANTS:= lines can be used; all constants are combined.

*** Column Names

Header row values can be used as column references. Given:

| Price | Quantity | Total |
|-------+----------+-------|
| 10    | 5        | 50    |
| 20    | 3        | 60    |
#+TBLFM: $Total=$Price*$Quantity

Column names are case-insensitive.

*** ⚠️ Duration Calculation Example

| Task    | Start | End   | Duration |
|---------+-------+-------+----------|
| Coding  | 9:00  | 12:30 | 12:30    |
| Meeting | 13:00 | 14:15 | 14:15    |
| Review  | 14:30 | 16:00 | 16:00    |
|---------+-------+-------+----------|
| Total   |       |       | 0:00     |
#+TBLFM: $4=$3-$2;U::@>$4=vsum(@2$4..@-1$4);U

Duration values are automatically parsed when the =T=, =U=, or =t= flag is
present. They are converted to seconds for calculation, then formatted
according to the flag.

*** ✅ Time Tracking Example
CLOSED: [2026-01-24 Sat 17:49]

| Date       | Hours |
|------------+-------|
| 2026-01-20 | 8:30  |
| 2026-01-21 | 7:45  |
| 2026-01-22 | 9:00  |
|------------+-------|
| Total      | 25:15 |
| Avg        | 8.42  |
#+TBLFM: @5$2=vsum(@2$2..@4$2);U::@6$2=vmean(@2$2..@4$2);t

** ✅ Remote Table References
CLOSED: [2026-01-24 Sat 17:31]

Reference cells from other named tables in the document:


#+NAME: rates
| Region | Rate |
|--------+------|
| US     | 0.10 |
| EU     | 0.20 |

#+NAME: sales
| Region | Revenue | Tax |
|--------+---------+-----|
| US     | 1000    | 100 |
| EU     | 2000    | 400 |
#+TBLFM: @2$3=$2*remote(rates,@2$2)::@3$3=$2*remote(rates,@3$2)


The =remote(tablename, reference)= function retrieves a value from another
table named with =#+NAME:=.

